SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM21/Include/bgm21_synth.h
/* Bit fields for SYNTH IPVERSION */
#define _SYNTH_IPVERSION_RESETVALUE                   0x00000000UL                              /**< Default value for SYNTH_IPVERSION           */
#define _SYNTH_IPVERSION_MASK                         0xFFFFFFFFUL                              /**< Mask for SYNTH_IPVERSION                    */
#define _SYNTH_IPVERSION_IPVERSION_SHIFT              0                                         /**< Shift value for SYNTH_IPVERSION             */
#define _SYNTH_IPVERSION_IPVERSION_MASK               0xFFFFFFFFUL                              /**< Bit mask for SYNTH_IPVERSION                */
#define _SYNTH_IPVERSION_IPVERSION_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for SYNTH_IPVERSION            */
#define SYNTH_IPVERSION_IPVERSION_DEFAULT             (_SYNTH_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for SYNTH_IPVERSION    */

/* Bit fields for SYNTH EN */
#define _SYNTH_EN_RESETVALUE                          0x00000000UL                      /**< Default value for SYNTH_EN                  */
#define _SYNTH_EN_MASK                                0x00000001UL                      /**< Mask for SYNTH_EN                           */
#define SYNTH_EN_EN                                   (0x1UL << 0)                      /**< Enable peripheral clock to this module      */
#define _SYNTH_EN_EN_SHIFT                            0                                 /**< Shift value for SYNTH_EN                    */
#define _SYNTH_EN_EN_MASK                             0x1UL                             /**< Bit mask for SYNTH_EN                       */
#define _SYNTH_EN_EN_DEFAULT                          0x00000000UL                      /**< Mode DEFAULT for SYNTH_EN                   */
#define SYNTH_EN_EN_DEFAULT                           (_SYNTH_EN_EN_DEFAULT << 0)       /**< Shifted mode DEFAULT for SYNTH_EN           */

/* Bit fields for SYNTH STATUS */
#define _SYNTH_STATUS_RESETVALUE                      0x00000000UL                          /**< Default value for SYNTH_STATUS              */
#define _SYNTH_STATUS_MASK                            0x04014707UL                          /**< Mask for SYNTH_STATUS                       */
#define SYNTH_STATUS_INLOCK                           (0x1UL << 0)                          /**< RF Synthesizer in Lock                      */
#define _SYNTH_STATUS_INLOCK_SHIFT                    0                                     /**< Shift value for SYNTH_INLOCK                */
#define _SYNTH_STATUS_INLOCK_MASK                     0x1UL                                 /**< Bit mask for SYNTH_INLOCK                   */
#define _SYNTH_STATUS_INLOCK_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for SYNTH_STATUS               */
#define SYNTH_STATUS_INLOCK_DEFAULT                   (_SYNTH_STATUS_INLOCK_DEFAULT << 0)   /**< Shifted mode DEFAULT for SYNTH_STATUS       */
#define SYNTH_STATUS_IFFREQEN                         (0x1UL << 1)                          /**< Synthesizer IF frequency enable status      */
#define _SYNTH_STATUS_IFFREQEN_SHIFT                  1                                     /**< Shift value for SYNTH_IFFREQEN              */
#define _SYNTH_STATUS_IFFREQEN_MASK                   0x2UL                                 /**< Bit mask for SYNTH_IFFREQEN                 */
#define _SYNTH_STATUS_IFFREQEN_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SYNTH_STATUS               */
#define SYNTH_STATUS_IFFREQEN_DEFAULT                 (_SYNTH_STATUS_IFFREQEN_DEFAULT << 1) /**< Shifted mode DEFAULT for SYNTH_STATUS       */

/* Bit fields for SYNTH CMD */
#define _SYNTH_CMD_RESETVALUE                         0x00000000UL                          /**< Default value for SYNTH_CMD                 */
#define _SYNTH_CMD_MASK                               0x0000061FUL                          /**< Mask for SYNTH_CMD                          */
#define SYNTH_CMD_SYNTHSTART                          (0x1UL << 0)                          /**< Starts the RF synthesizer                   */
#define _SYNTH_CMD_SYNTHSTART_SHIFT                   0                                     /**< Shift value for SYNTH_SYNTHSTART            */
#define _SYNTH_CMD_SYNTHSTART_MASK                    0x1UL                                 /**< Bit mask for SYNTH_SYNTHSTART               */
#define _SYNTH_CMD_SYNTHSTART_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for SYNTH_CMD                  */
#define SYNTH_CMD_SYNTHSTART_DEFAULT                  (_SYNTH_CMD_SYNTHSTART_DEFAULT << 0)  /**< Shifted mode DEFAULT for SYNTH_CMD          */
#define SYNTH_CMD_SYNTHSTOP                           (0x1UL << 1)                          /**< Stops the RF synthesizer                    */
#define _SYNTH_CMD_SYNTHSTOP_SHIFT                    1                                     /**< Shift value for SYNTH_SYNTHSTOP             */
#define _SYNTH_CMD_SYNTHSTOP_MASK                     0x2UL                                 /**< Bit mask for SYNTH_SYNTHSTOP                */
#define _SYNTH_CMD_SYNTHSTOP_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for SYNTH_CMD                  */
#define SYNTH_CMD_SYNTHSTOP_DEFAULT                   (_SYNTH_CMD_SYNTHSTOP_DEFAULT << 1)   /**< Shifted mode DEFAULT for SYNTH_CMD          */
#define SYNTH_CMD_ENABLEIF                            (0x1UL << 2)                          /**< Enable the synthesizer IF frequency         */
#define _SYNTH_CMD_ENABLEIF_SHIFT                     2                                     /**< Shift value for SYNTH_ENABLEIF              */
#define _SYNTH_CMD_ENABLEIF_MASK                      0x4UL                                 /**< Bit mask for SYNTH_ENABLEIF                 */
#define _SYNTH_CMD_ENABLEIF_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for SYNTH_CMD                  */
#define SYNTH_CMD_ENABLEIF_DEFAULT                    (_SYNTH_CMD_ENABLEIF_DEFAULT << 2)    /**< Shifted mode DEFAULT for SYNTH_CMD          */
#define SYNTH_CMD_DISABLEIF                           (0x1UL << 3)                          /**< Disable the synthesizer IF frequency        */
#define _SYNTH_CMD_DISABLEIF_SHIFT                    3                                     /**< Shift value for SYNTH_DISABLEIF             */
#define _SYNTH_CMD_DISABLEIF_MASK                     0x8UL                                 /**< Bit mask for SYNTH_DISABLEIF                */
#define _SYNTH_CMD_DISABLEIF_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for SYNTH_CMD                  */
#define SYNTH_CMD_DISABLEIF_DEFAULT                   (_SYNTH_CMD_DISABLEIF_DEFAULT << 3)   /**< Shifted mode DEFAULT for SYNTH_CMD          */
#define SYNTH_CMD_CAPCALSTART                         (0x1UL << 4)                          /**< Start VCO capacitor array calibration       */
#define _SYNTH_CMD_CAPCALSTART_SHIFT                  4                                     /**< Shift value for SYNTH_CAPCALSTART           */
#define _SYNTH_CMD_CAPCALSTART_MASK                   0x10UL                                /**< Bit mask for SYNTH_CAPCALSTART              */
#define _SYNTH_CMD_CAPCALSTART_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SYNTH_CMD                  */
#define SYNTH_CMD_CAPCALSTART_DEFAULT                 (_SYNTH_CMD_CAPCALSTART_DEFAULT << 4) /**< Shifted mode DEFAULT for SYNTH_CMD          */

